import { create } from "zustand";

export const dhikrsList = [
  "سبحان الله وبحمده",
  "لا حول ولا قوة إلا بالله العلي العظيم",
  "اللهم صل وسلم وبارك على نبينا محمد",
  "أستغفر الله العظيم وأتوب إليه",
  "لا إله إلا أنت سبحانك إني كنت من الظالمين",
  "سبحان الله والحمد لله ولا إله إلا الله والله أكبر",
  "لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شئ قدير",
  "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ، ولا تكلني إلى نفسي طرفة عين",
  "اللهم إني أسألك علما نافعا ورزقا طيبا وعملا متقبلا",
  "استحضر النية في عملك",
  "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرض العظيم",
  "سبحان الله العظيم وبحمده",
  "اللهم أعني على ذكرك وشكرك وحسن عبادتك",
  "ربي اغفر لي وتب علي إنك انت التواب الرحيم",
  "اللهم اكفني بحلالك عن حرامك واغنني بفضلك عن من سواك",
];

type useDhikrStoreProps = {
  dhikrList: string[];
  addDhikr: (newDhikr: string) => void;
};

export const useDhikrStore = create<useDhikrStoreProps>((set) => ({
  dhikrList: dhikrsList,
  addDhikr: (newDhikr: string) =>
    set((state) => ({ dhikrList: [...state.dhikrList, newDhikr] })),
}));
